Autodesk.Revit.DB.DimensionGeometryOptions.ClearTextOverrideForSegment(System.Int32)
Removes any text override for the specified DimensionSegment.
segmentIndex:
The DimensionSegment index.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Index out of range.

Autodesk.Revit.DB.DimensionGeometryOptions.SetTextOverrideForSegment(System.String,System.Int32)
The text which will override the computed value from the Dimension, for the indicated DimensionSegment.
text:
The override text.
segmentIndex:
The DimensionSegment index.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Index out of range.

Autodesk.Revit.DB.DimensionGeometryOptions.SetView(Autodesk.Revit.DB.View)
Fills in the view in which the dimension is drawn.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.DimensionGeometryOptions.SetDimensionStyle(Autodesk.Revit.DB.DimensionType)
Fills in the dimension style.

Autodesk.Revit.DB.DimensionGeometryOptions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.DimensionGeometryOptions
The base class that encapsulates common options needed to create various Dimension geometry.